app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def show
    @posts = Post.all

INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "ok"], ["description", "asgasgasdg"], ["created_at", "2016-06-30 19:19:04.472531"], ["updated_at", "2016-06-30 19:19:04.472531"]]
---
  def create
    @post = Post.new(post_params)
    if @post.save